In [ ]:
import pandas as pd
df =  pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')
df.shape

(2394, 8)

In [ ]:
df.dtypes

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

In [ ]:
len(df['Location'].unique())

23

In [25]:
len(df.loc[(df['Nationality'] == 'USA')])

638

In [27]:
df.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64